In [1]:
import pandas as pd

In [3]:
name = pd.Series({"001":"小陈","002":"小李","003":"小王","004":"小张","005":"小赵","006":"小周"})
gender = pd.Series({"001":"男","002":"女","003":"男","004":"男","005":"女","006":"女"})
height = pd.Series({"001":173.1,"002":188.2,"003":188.4,"004":181.2,"005":199.2,"006":222.4})

In [5]:
students = pd.DataFrame({"姓名":name,"性别":gender,"身高":height})
students

     姓名 性别     身高
001  小陈  男  173.1
002  小李  女  188.2
003  小王  男  188.4
004  小张  男  181.2
005  小赵  女  199.2
006  小周  女  222.4

In [6]:
students.T

      001    002    003    004    005    006
姓名     小陈     小李     小王     小张     小赵     小周
性别      男      女      男      男      女      女
身高  173.1  188.2  188.4  181.2  199.2  222.4

In [7]:
print(students.index)#横着的
print(students.columns)#竖着的

Index(['001', '002', '003', '004', '005', '006'], dtype='object')
Index(['姓名', '性别', '身高'], dtype='object')

In [9]:
students.身高

001    173.1
002    188.2
003    188.4
004    181.2
005    199.2
006    222.4
Name: 身高, dtype: float64

In [10]:
students["身高"]

001    173.1
002    188.2
003    188.4
004    181.2
005    199.2
006    222.4
Name: 身高, dtype: float64

In [12]:
students[["姓名","身高"]]

     姓名     身高
001  小陈  173.1
002  小李  188.2
003  小王  188.4
004  小张  181.2
005  小赵  199.2
006  小周  222.4

In [14]:
students.loc["001"]

姓名       小陈
性别        男
身高    173.1
Name: 001, dtype: object

In [15]:
students.loc[["001","002"]]

     姓名 性别     身高
001  小陈  男  173.1
002  小李  女  188.2

In [18]:
students.loc["001","身高"]

np.float64(173.1)

In [19]:
students.loc[["001","005"],["姓名","身高"]]

     姓名     身高
001  小陈  173.1
005  小赵  199.2

In [22]:
students.loc[["001","002"],"姓名":"身高"]
students.loc[["001","002"],:]

     姓名 性别     身高
001  小陈  男  173.1
002  小李  女  188.2

In [24]:
students[(students["身高"]>165) & (students["性别"] == "女")]

     姓名 性别     身高
002  小李  女  188.2
005  小赵  女  199.2
006  小周  女  222.4

In [25]:
students.head(2)

     姓名 性别     身高
001  小陈  男  173.1
002  小李  女  188.2